src/cf/DataProcessors/ПомощникРасчетаНалогаУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПомощникРасчетаНалогаУСН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/AccumulationRegisters/КнигаУчетаДоходовИРасходовРаздел4.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>КнигаУчетаДоходовИРасходовРаздел4</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПФР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФСС_НС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Больничные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобровольноеСтрахование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеквизитыПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасхода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеятельностьНаТорговомСборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗарплаты</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезерваОтпусков</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияИИзносОС</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНУЛизинговыхПлатежей</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМАИсписаниеРасходовПоНИОКР</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета97</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеОСДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДопРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТаможенныхПлатежейДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетДолейСписанияКосвенныхРасходов</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов20_23_25_26</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета44</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПоСомнительнымДолгам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеАвансовВПрочиеДоходыДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляУСН</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСтраховыхВзносовИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРасходовУменьшающихОтдельныеНалоги</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов90_91</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеУбытковПрошлыхЛет</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЕНВД</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеформацияБаланса</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/РегламентнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РегламентнаяОперация</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасчетНалогаНаИмущество</xr:Item>
				<xr:Item>InformationRegister.ДолиСписанияКосвенныхРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ИПРасходыНаОплатуТруда</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасчеты</xr:Item>
				<xr:Item>InformationRegister.РасчетРезервовПоСомнительнымДолгам</xr:Item>
				<xr:Item>InformationRegister.РасчетПорядкаПеределов</xr:Item>
				<xr:Item>AccumulationRegister.ИПРБП</xr:Item>
				<xr:Item>InformationRegister.РасчетСписанияКосвенныхРасходов</xr:Item>
				<xr:Item>InformationRegister.РасчетРазницВОценкеАктивовИОбязательств</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗ</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗОбороты</xr:Item>
				<xr:Item>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль</xr:Item>
				<xr:Item>InformationRegister.РасчетЗемельногоНалога</xr:Item>
				<xr:Item>InformationRegister.РасчетНалогаУСН</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходовНМА</xr:Item>
				<xr:Item>InformationRegister.РасчетТорговойНаценкиНТТ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел4</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасчетСписанияРБП</xr:Item>
				<xr:Item>InformationRegister.РасчетРасходовПоАренде</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияКосвенныхРасходов</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ИПИныеМатериальныеРасходы</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>InformationRegister.РасчетТорговойНаценкиАТТ</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеДоходы</xr:Item>
				<xr:Item>AccumulationRegister.РасходыНаПлатон</xr:Item>
				<xr:Item>InformationRegister.РасчетНормированияРасходов</xr:Item>
				<xr:Item>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательств</xr:Item>
				<xr:Item>InformationRegister.РасчетТранспортногоНалога</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимостиПродукции</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходовОС</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗОтгруженные</xr:Item>
				<xr:Item>AccumulationRegister.РасходыУменьшающиеНалогПоОтдельнымРежимам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьОшибки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОшибочныйОбъект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ПомощникРасчетаНалогаУСН/Forms/РасшифровкаУменьшенияНалога/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноСоздаватьЗаписиКУДиР = ПравоДоступа("Изменение", Метаданные.Документы.ЗаписьКУДиР);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, НачалоПериода, КонецПериода");
	
	Заголовок = ТекстЗаголовка();
	
	ОбъектНалогообложенияДоходы = УчетнаяПолитика.ПрименяетсяУСНДоходы(Организация, КонецПериода);
	
	ЗаполнитьТабличнуюЧасть();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПлатежныйДокумент_УплатаНалогов" ИЛИ ИмяСобытия = "ИзменениеВыписки"
			ИЛИ ИмяСобытия = "ИзменениеЗаписиКУДиР" ИЛИ ИмяСобытия = "ИзменениеОперацииБух"
			ИЛИ ИмяСобытия = "ИзменениеНачисленияЗарплаты" ИЛИ ИмяСобытия = "ИзменениеОтраженияЗарплатыВБухучете" 
			ИЛИ ИмяСобытия = "ИзменениеОтраженияЗарплатыВУчете" Тогда
		ЗаполнитьТабличнуюЧасть();
		УправлениеФормой(ЭтотОбъект);
	ИначеЕсли ИмяСобытия = "ОбновитьПоказателиРасчетаУСН" И Источник <> ЭтотОбъект Тогда
		
		ЗаполнитьТабличнуюЧасть();
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.ДокументРасхода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыФормы.Вставить("КонецПериода", КонецПериода);
		ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаписьКУДиР.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьТабличнуюЧасть();
	УправлениеФормой(ЭтотОбъект);
	
	Оповестить("ОбновитьПоказателиРасчетаУСН", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СоздатьДокумент.Доступность = Форма.МожноСоздаватьЗаписиКУДиР;
	
	Если НЕ Форма.ОбъектНалогообложенияДоходы Тогда
		Элементы.Период.ТекстПодвала          = "Всего: " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");;
		Элементы.ПФР.ТекстПодвала             = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.ФСС.ТекстПодвала             = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.ФОМС.ТекстПодвала            = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.ФСС_НС.ТекстПодвала          = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.Больничные.ТекстПодвала      = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.ДМС.ТекстПодвала             = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
		Элементы.ДокументРасхода.ТекстПодвала = ОбщегоНазначенияБПВызовСервера.ФорматСумм(0, , "0.00", " ");
	Иначе
		ИтогоПФР        = 0;
		ИтогоФСС        = 0;
		ИтогоФОМС       = 0;
		ИтогоФСС_НС     = 0;
		ИтогоБольничные = 0;
		ИтогоДМС        = 0;
		
		Для Каждого Колонка Из Форма.Список Цикл
			ИтогоПФР        = ИтогоПФР        + Колонка.ПФР;
			ИтогоФСС        = ИтогоФСС        + Колонка.ФСС;
			ИтогоФОМС       = ИтогоФОМС       + Колонка.ФОМС;
			ИтогоФСС_НС     = ИтогоФСС_НС     + Колонка.ФСС_НС;
			ИтогоБольничные = ИтогоБольничные + Колонка.Больничные;
			ИтогоДМС        = ИтогоДМС        + Колонка.ДобровольноеСтрахование;
		КонецЦикла;
		
		ИтогоРасходы = ИтогоПФР + ИтогоФСС + ИтогоФОМС + ИтогоФСС_НС + ИтогоБольничные + ИтогоДМС;
		
		Элементы.Период.ТекстПодвала     = "Всего: " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоРасходы, , "0.00", " ");;
		Элементы.ПФР.ТекстПодвала        = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоПФР, ,        "0.00", " ");
		Элементы.ФСС.ТекстПодвала        = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоФСС, ,        "0.00", " ");
		Элементы.ФОМС.ТекстПодвала       = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоФОМС, ,       "0.00", " ");
		Элементы.ФСС_НС.ТекстПодвала     = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоФСС_НС, ,     "0.00", " ");
		Элементы.Больничные.ТекстПодвала = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоБольничные, , "0.00", " ");
		Элементы.ДМС.ТекстПодвала        = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ИтогоДМС, ,        "0.00", " ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗаголовка()
	
	ПредставлениеПериода = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода, Истина);
	
	ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Расходы, уменьшающие сумму налога УСН за %1'"), ПредставлениеПериода);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстЗаголовка = ТекстЗаголовка + " " + БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(Организация);
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервере
Функция НайтиРегламентнуюОперацию()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",         КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода",          КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация",           Организация);
	Запрос.УстановитьПараметр("УменьшениеНалога",      Перечисления.ВидыРегламентныхОпераций.РасчетРасходовУменьшающихОтдельныеНалоги);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеМесяца.Ссылка КАК Документ
	|ИЗ
	|	Документ.РегламентнаяОперация КАК ЗакрытиеМесяца
	|ГДЕ
	|	ЗакрытиеМесяца.ВидОперации = &УменьшениеНалога
	|	И ЗакрытиеМесяца.Организация = &Организация
	|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСтруктуруШапкиДокумента()
	
	Ссылка              = НайтиРегламентнуюОперацию();
	ГоловнаяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);
	Отказ               = УчетнаяПолитикаСуществует(ГоловнаяОрганизация, Ссылка);
	
	Если Ссылка = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ЗаголовокДокумента = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	КонецЕсли;
	
	СтруктураШапки      = Новый Структура();
	
	Если Отказ Тогда
		Возврат СтруктураШапки;
	КонецЕсли;
	
	СтруктураШапки.Вставить("НачДата",                 НачалоПериода);
	СтруктураШапки.Вставить("КонДата",                 КонецПериода);
	СтруктураШапки.Вставить("НачГраница",              Новый Граница(СтруктураШапки.НачДата, ВидГраницы.Исключая));
	СтруктураШапки.Вставить("КонГраница",              Новый Граница(СтруктураШапки.КонДата, ВидГраницы.Включая));
	СтруктураШапки.Вставить("НачГода",                 НачалоГода(НачалоПериода));
	СтруктураШапки.Вставить("Организация",             Организация);
	СтруктураШапки.Вставить("Ссылка",                  Ссылка);
	СтруктураШапки.Вставить("Дата",                    Ссылка.Дата);
	СтруктураШапки.Вставить("Номер",                   Ссылка.Номер);
	СтруктураШапки.Вставить("ВидОперации",             Ссылка.ВидОперации);
	СтруктураШапки.Вставить("Заголовок",               ЗаголовокДокумента);
	СтруктураШапки.Вставить("ГоловноеПодразделение",   ГоловнаяОрганизация);
	СтруктураШапки.Вставить("Предприниматель",         УчетнаяПолитика.ПлательщикНДФЛ(Организация, СтруктураШапки.КонДата));
	
	ВсяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсяОрганизация(Организация);
	СписокОП = Новый СписокЗначений;
	
	Для Каждого ОбособленноеПодразделение Из ВсяОрганизация Цикл
		СписокОП.Добавить(ОбособленноеПодразделение);
	КонецЦикла;
	
	СтруктураШапки.Вставить("СписокОрганизаций", СписокОП);
	
	ЕстьОбособленныеПодразделения = СписокОП.Количество() > 1;
	СтруктураШапки.Вставить("ЕстьОбособленныеПодразделения", ЕстьОбособленныеПодразделения);
	СтруктураШапки.Вставить("СуммаПересчетаУбытков",0);
	
	Возврат СтруктураШапки;
	
КонецФункции

&НаСервере
Функция УчетнаяПолитикаСуществует(ОрганизацияДляУчетнойПолитики, Ссылка)
	
	Существует = УчетнаяПолитика.Существует(ОрганизацияДляУчетнойПолитики, КонецПериода, Ложь, Ссылка);
	Отказ      = Не Существует;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Функция ЗаписиРаздела4КУДиР()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Период,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Организация,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ПФР,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ФСС,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ФОМС,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ФСС_НС,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Больничные,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ДобровольноеСтрахование,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.ДокументРасхода,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Регистратор,
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.РеквизитыПервичногоДокумента
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел4 КАК РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4
	|ГДЕ
	|	РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Организация = &Организация
	|		И РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РегистрНакопленияКнигаУчетаДоходовИРасходовРаздел4.Регистратор ССЫЛКА Документ.ЗаписьКУДиР
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	Если НЕ ОбъектНалогообложенияДоходы Тогда
		Список.Очистить();
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента = ЗаполнитьСтруктуруШапкиДокумента();
	
	Если СтруктураШапкиДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.РегламентнаяОперация.ПодготовитьПараметрыРасчетаРасходовУменьшающихНалоги(
		СтруктураШапкиДокумента, Ложь);
		
	ОбщаяТаблицаРасходов = УчетРасходовУменьшающихОтдельныеНалоги.РасчетРасходовУменьшающихОтдельныеНалоги(
		ПараметрыПроведения.ТаблицаРеквизиты, Истина);
		
	ТаблицаРасходовУменьшающихНалог = УчетУСН.ПодготовитьТаблицуДвиженийПоРазделу4КУДиР(ОбщаяТаблицаРасходов,
		ПараметрыПроведения.ТаблицаРеквизиты);
		
	ТаблицаРасходовУменьшающихНалог.Колонки.Добавить("НомерДокумента");
	ТаблицаРасходовУменьшающихНалог.Колонки.Добавить("ПредставлениеДокумента");
	ОписаниеТипов = Документы.ТипВсеСсылки();
	
	ЗаписиКУДиР = ЗаписиРаздела4КУДиР();
	
	// Объединим две таблицы
	Если ЗаписиКУДиР.Количество() > 0 Тогда
		Для Каждого СтрокаТаблицыИсточника Из ЗаписиКУДиР Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаРасходовУменьшающихНалог.Добавить(), СтрокаТаблицыИсточника);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаРасходовУменьшающихНалог Цикл
		ДокументРасходаПоСтроке = СтрокаТаблицы.ДокументРасхода;
		Значение                = ТипЗнч(ДокументРасходаПоСтроке);
		
		Если Значение = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Выдача наличных, вх. " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Списание с расчетного счета, вх. " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.ЗаписьКУДиР") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Запись книги доходов и расходов УСН " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.ОперацияБух") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Операция " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Начисление зарплаты " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.ОтражениеЗарплатыВБухучете") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Отражение зарплаты в бухучете " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		ИначеЕсли Значение = Тип("ДокументСсылка.ОтражениеЗарплатыВУчете") Тогда
			СтрокаТаблицы.ПредставлениеДокумента = "Зарплата (ЗУП 2.5, ЗиК 7.7) " + СтрокаТаблицы.РеквизитыПервичногоДокумента;
		КонецЕсли;
		
		СтрокаТаблицы.Период         = ДокументРасходаПоСтроке.Дата;
		СтрокаТаблицы.НомерДокумента = ДокументРасходаПоСтроке.Номер;
	КонецЦикла;
	
	ТаблицаРасходовУменьшающихНалог.Сортировать("Период");
	Список.Загрузить(ТаблицаРасходовУменьшающихНалог);
	
КонецПроцедуры

#КонецОбласти
